[
  {
    "name": "Code pénal",
    "synonyms": [
      "code penal",
      "code pénal",
      "code penal marocain",
      "droit pénal"
    ],
    "description": "Le Code pénal marocain est la codification du droit pénal au Maroc. Il est entré en vigueur le 17 juin 1963 pour remplacer le Code pénal de 1913 et a été promulgué par le dahir n° 413‑59‑1. Ce texte a été amendé à plusieurs reprises pour l’aligner aux conventions internationales ratifiées par le Royaume et a fait l’objet d’une réforme importante en 2015【903596720684853†L51-L56】."
  },
  {
    "name": "Code de procédure civile",
    "synonyms": [
      "code de procedure civile",
      "code procédure civile",
      "procédure civile"
    ],
    "description": "Au Maroc, le Code de procédure civile est le texte législatif qui édicte l’ensemble des règles relatives à l’organisation d’une action en justice devant une juridiction civile【323337165343260†L51-L53】."
  },
  {
    "name": "Code de commerce",
    "synonyms": [
      "code de commerce",
      "code commerce",
      "commerce"
    ],
    "description": "Le Code de commerce marocain est le texte législatif qui régit les actes de commerce et les commerçants【814558194886996†L55-L56】."
  },
  {
    "name": "Moudawana (Code de la famille)",
    "synonyms": [
      "moudawana",
      "code de la famille",
      "mudawana",
      "code du statut personnel"
    ],
    "description": "La Moudawana, ou Code de la famille, est un corpus de lois adoptées en 1958 qui régit des domaines tels que le mariage, le divorce, l’héritage et la garde des enfants. À partir de 2004, une réforme majeure a renforcé les droits des femmes en leur conférant l’auto‑tutelle, en reconnaissant leur droit au divorce et à la garde des enfants, en restreignant la polygamie, en relevant l’âge légal du mariage à 18 ans et en faisant du harcèlement sexuel un délit【256087100380842†L63-L69】【256087100380842†L103-L107】. Sous l’ancienne version, les hommes pouvaient divorcer unilatéralement et imposer des unions ; la réforme met fin à ces pratiques【256087100380842†L111-L119】."
  }
  ,
  {
    "name": "Loi sur la protection du consommateur",
    "synonyms": [
      "loi 31-08",
      "loi 31 08",
      "protection du consommateur",
      "loi de protection du consommateur",
      "consumer protection law"
    ],
    "description": "La loi n° 31‑08 édictant des mesures de protection du consommateur renforce les droits des consommateurs en leur garantissant une meilleure information, en les protégeant contre les clauses abusives et certaines pratiques commerciales et en prévoyant des dispositions complémentaires relatives aux garanties et au service après‑vente. Elle permet également aux associations de consommateurs reconnues d’utilité publique d’ester en justice pour représenter les intérêts collectifs des consommateurs【937320796469539†L47-L57】."
  },
  {
    "name": "Loi sur la presse et l’édition",
    "synonyms": [
      "loi 88-13",
      "loi 88 13",
      "presse et édition",
      "code de la presse",
      "press and publishing law",
      "loi sur la presse"
    ],
    "description": "La loi n° 88‑13 relative à la presse et à l’édition, composante du code de la presse et de l’édition, encadre l’exercice de la presse et réglemente la publicité. Elle interdit toute publicité incitant à la haine, au terrorisme, aux crimes de guerre, au génocide ou à la torture, ainsi que toute atteinte basée sur la religion, le sexe ou la couleur【477222936406586†L1310-L1321】. Elle proscrit également la propagation de fausses nouvelles et de contenus portant atteinte à la religion islamique, au régime monarchique ou à l’intégrité territoriale et sanctionne de 20 000 à 200 000 dirhams la publication de fausses informations【477222936406586†L1436-L1449】. Ces dispositions visent à protéger le public et à garantir le respect des droits fondamentaux dans le domaine de la communication écrite et électronique."
  }
]